LoadTesting/Initialize_Login_1000-Production.txt
Run #1:

Running 2m test @ https://api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 4646.264ms, rate sampling interval: 16187ms
  Thread calibration: mean lat.: 4615.593ms, rate sampling interval: 16211ms
  Thread calibration: mean lat.: 4656.043ms, rate sampling interval: 16236ms
  Thread calibration: mean lat.: 4636.466ms, rate sampling interval: 16162ms
  Thread calibration: mean lat.: 4677.065ms, rate sampling interval: 16228ms
  Thread calibration: mean lat.: 4720.008ms, rate sampling interval: 16252ms
  Thread calibration: mean lat.: 4678.492ms, rate sampling interval: 16236ms
  Thread calibration: mean lat.: 4708.304ms, rate sampling interval: 16211ms
  Thread calibration: mean lat.: 4677.699ms, rate sampling interval: 16236ms
  Thread calibration: mean lat.: 4677.244ms, rate sampling interval: 16236ms
  Thread calibration: mean lat.: 4706.553ms, rate sampling interval: 16203ms
  Thread calibration: mean lat.: 4718.647ms, rate sampling interval: 16252ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.97m    28.43s    1.79m    58.11%
    Req/Sec     8.00      0.00     8.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.97m
 75.000%    1.38m
 90.000%    1.63m
 99.000%    1.78m
 99.900%    1.79m
 99.990%    1.79m
 99.999%    1.79m
100.000%    1.79m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9035.775     0.000000            1         1.00
   18857.983     0.100000         1131         1.11
   28803.071     0.200000         2260         1.25
   38305.791     0.300000         3390         1.43
   48005.119     0.400000         4521         1.67
   57933.823     0.500000         5651         2.00
   62783.487     0.550000         6216         2.22
   67764.223     0.600000         6780         2.50
   72613.887     0.650000         7351         2.86
   77725.695     0.700000         7915         3.33
   82509.823     0.750000         8483         4.00
   85000.191     0.775000         8756         4.44
   87621.631     0.800000         9040         5.00
   90243.071     0.825000         9326         5.71
   92798.975     0.850000         9606         6.67
   95158.271     0.875000         9891         8.00
   96534.527     0.887500        10035         8.89
   97648.639     0.900000        10168        10.00
   98828.287     0.912500        10309        11.43
  100335.615     0.925000        10454        13.33
  101646.335     0.937500        10598        16.00
  102301.695     0.943750        10672        17.78
  102825.983     0.950000        10738        20.00
  103481.343     0.956250        10811        22.86
  104136.703     0.962500        10880        26.67
  104595.455     0.968750        10944        32.00
  105054.207     0.971875        10983        35.56
  105381.887     0.975000        11021        40.00
  105644.031     0.978125        11056        45.71
  105971.711     0.981250        11086        53.33
  106233.855     0.984375        11121        64.00
  106364.927     0.985938        11142        71.11
  106495.999     0.987500        11165        80.00
  106561.535     0.989062        11174        91.43
  106823.679     0.990625        11196       106.67
  106954.751     0.992188        11214       128.00
  107020.287     0.992969        11225       142.22
  107085.823     0.993750        11233       160.00
  107151.359     0.994531        11238       182.86
  107216.895     0.995313        11246       213.33
  107282.431     0.996094        11254       256.00
  107347.967     0.996484        11264       284.44
  107347.967     0.996875        11264       320.00
  107413.503     0.997266        11274       365.71
  107413.503     0.997656        11274       426.67
  107479.039     0.998047        11284       512.00
  107479.039     0.998242        11284       568.89
  107479.039     0.998437        11284       640.00
  107479.039     0.998633        11284       731.43
  107479.039     0.998828        11284       853.33
  107544.575     0.999023        11291      1024.00
  107544.575     0.999121        11291      1137.78
  107544.575     0.999219        11291      1280.00
  107544.575     0.999316        11291      1462.86
  107544.575     0.999414        11291      1706.67
  107610.111     0.999512        11295      2048.00
  107610.111     0.999561        11295      2275.56
  107610.111     0.999609        11295      2560.00
  107610.111     0.999658        11295      2925.71
  107610.111     0.999707        11295      3413.33
  107610.111     0.999756        11295      4096.00
  107610.111     0.999780        11295      4551.11
  107610.111     0.999805        11295      5120.00
  107675.647     0.999829        11297      5851.43
  107675.647     1.000000        11297          inf
#[Mean    =    58056.278, StdDeviation   =    28434.652]
#[Max     =   107610.112, Total count    =        11297]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12275 requests in 2.00m, 3.36MB read
  Non-2xx or 3xx responses: 12275
Requests/sec:    102.26
Transfer/sec:     28.66KB

Run #2:

Running 2m test @ https://api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 4509.342ms, rate sampling interval: 15720ms
  Thread calibration: mean lat.: 4485.975ms, rate sampling interval: 15704ms
  Thread calibration: mean lat.: 4526.342ms, rate sampling interval: 15622ms
  Thread calibration: mean lat.: 4522.407ms, rate sampling interval: 15564ms
  Thread calibration: mean lat.: 4522.749ms, rate sampling interval: 15564ms
  Thread calibration: mean lat.: 4478.379ms, rate sampling interval: 15704ms
  Thread calibration: mean lat.: 4520.713ms, rate sampling interval: 15728ms
  Thread calibration: mean lat.: 4500.808ms, rate sampling interval: 15720ms
  Thread calibration: mean lat.: 4521.132ms, rate sampling interval: 15556ms
  Thread calibration: mean lat.: 4556.688ms, rate sampling interval: 15720ms
  Thread calibration: mean lat.: 4512.222ms, rate sampling interval: 15720ms
  Thread calibration: mean lat.: 4480.105ms, rate sampling interval: 15622ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.88m    26.99s    1.75m    59.87%
    Req/Sec     9.90      1.51    11.00     85.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.88m
 75.000%    1.24m
 90.000%    1.52m
 99.000%    1.73m
 99.900%    1.75m
 99.990%    1.75m
 99.999%    1.75m
100.000%    1.75m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8658.943     0.000000            2         1.00
   16875.519     0.100000         1369         1.11
   25313.279     0.200000         2735         1.25
   33751.039     0.300000         4104         1.43
   42303.487     0.400000         5471         1.67
   52789.247     0.500000         6843         2.00
   57081.855     0.550000         7523         2.22
   61276.159     0.600000         8205         2.50
   65535.999     0.650000         8891         2.86
   70123.519     0.700000         9576         3.33
   74317.823     0.750000        10266         4.00
   76414.975     0.775000        10599         4.44
   78577.663     0.800000        10946         5.00
   83099.647     0.825000        11284         5.71
   85196.799     0.850000        11635         6.67
   87228.415     0.875000        11968         8.00
   88276.991     0.887500        12137         8.89
   91422.719     0.900000        12310        10.00
   94240.767     0.912500        12481        11.43
   95944.703     0.925000        12652        13.33
   97714.175     0.937500        12831        16.00
   98566.143     0.943750        12913        17.78
   99155.967     0.950000        12999        20.00
   99876.863     0.956250        13084        22.86
  100532.223     0.962500        13165        26.67
  101253.119     0.968750        13248        32.00
  101646.335     0.971875        13296        35.56
  101974.015     0.975000        13337        40.00
  102432.767     0.978125        13383        45.71
  102760.447     0.981250        13428        53.33
  103088.127     0.984375        13462        64.00
  103350.271     0.985938        13491        71.11
  103481.343     0.987500        13506        80.00
  103677.951     0.989062        13530        91.43
  103809.023     0.990625        13551       106.67
  104005.631     0.992188        13569       128.00
  104202.239     0.992969        13586       142.22
  104267.775     0.993750        13597       160.00
  104333.311     0.994531        13604       182.86
  104398.847     0.995313        13612       213.33
  104529.919     0.996094        13626       256.00
  104595.455     0.996484        13634       284.44
  104595.455     0.996875        13634       320.00
  104660.991     0.997266        13646       365.71
  104660.991     0.997656        13646       426.67
  104726.527     0.998047        13657       512.00
  104726.527     0.998242        13657       568.89
  104726.527     0.998437        13657       640.00
  104726.527     0.998633        13657       731.43
  104792.063     0.998828        13663       853.33
  104792.063     0.999023        13663      1024.00
  104792.063     0.999121        13663      1137.78
  104857.599     0.999219        13670      1280.00
  104857.599     0.999316        13670      1462.86
  104857.599     0.999414        13670      1706.67
  104857.599     0.999512        13670      2048.00
  104857.599     0.999561        13670      2275.56
  104857.599     0.999609        13670      2560.00
  104923.135     0.999658        13673      2925.71
  104923.135     0.999707        13673      3413.33
  104923.135     0.999756        13673      4096.00
  104923.135     0.999780        13673      4551.11
  104923.135     0.999805        13673      5120.00
  104923.135     0.999829        13673      5851.43
  104923.135     0.999854        13673      6826.67
  104988.671     0.999878        13675      8192.00
  104988.671     1.000000        13675          inf
#[Mean    =    52959.300, StdDeviation   =    26987.064]
#[Max     =   104923.136, Total count    =        13675]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15061 requests in 2.00m, 4.12MB read
  Non-2xx or 3xx responses: 15061
Requests/sec:    125.37
Transfer/sec:     35.14KB

Run #3

Running 2m test @ https://api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 5203.296ms, rate sampling interval: 16809ms
  Thread calibration: mean lat.: 5238.835ms, rate sampling interval: 16760ms
  Thread calibration: mean lat.: 5202.499ms, rate sampling interval: 16809ms
  Thread calibration: mean lat.: 5169.696ms, rate sampling interval: 16842ms
  Thread calibration: mean lat.: 5238.427ms, rate sampling interval: 16760ms
  Thread calibration: mean lat.: 5127.322ms, rate sampling interval: 16793ms
  Thread calibration: mean lat.: 5217.683ms, rate sampling interval: 16793ms
  Thread calibration: mean lat.: 5162.886ms, rate sampling interval: 16572ms
  Thread calibration: mean lat.: 5235.312ms, rate sampling interval: 16744ms
  Thread calibration: mean lat.: 5217.746ms, rate sampling interval: 16793ms
  Thread calibration: mean lat.: 5161.391ms, rate sampling interval: 16564ms
  Thread calibration: mean lat.: 5234.309ms, rate sampling interval: 16736ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.97m    28.59s    1.80m    57.57%
    Req/Sec     8.01      0.12     9.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.96m
 75.000%    1.38m
 90.000%    1.63m
 99.000%    1.78m
 99.900%    1.80m
 99.990%    1.80m
 99.999%    1.80m
100.000%    1.80m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9134.079     0.000000            2         1.00
   18694.143     0.100000         1136         1.11
   28180.479     0.200000         2270         1.25
   37552.127     0.300000         3407         1.43
   47742.975     0.400000         4541         1.67
   57868.287     0.500000         5678         2.00
   62783.487     0.550000         6243         2.22
   67567.615     0.600000         6819         2.50
   72679.423     0.650000         7381         2.86
   77856.767     0.700000         7947         3.33
   82903.039     0.750000         8512         4.00
   85327.871     0.775000         8798         4.44
   87949.311     0.800000         9082         5.00
   90243.071     0.825000         9366         5.71
   92602.367     0.850000         9648         6.67
   94896.127     0.875000         9932         8.00
   96272.383     0.887500        10075         8.89
   97517.567     0.900000        10217        10.00
   99155.967     0.912500        10359        11.43
  100466.687     0.925000        10498        13.33
  101646.335     0.937500        10639        16.00
  102301.695     0.943750        10712        17.78
  103022.591     0.950000        10784        20.00
  103677.951     0.956250        10855        22.86
  104267.775     0.962500        10926        26.67
  104923.135     0.968750        10995        32.00
  105185.279     0.971875        11033        35.56
  105447.423     0.975000        11071        40.00
  105775.103     0.978125        11106        45.71
  106037.247     0.981250        11138        53.33
  106299.391     0.984375        11174        64.00
  106495.999     0.985938        11191        71.11
  106692.607     0.987500        11210        80.00
  106823.679     0.989062        11229        91.43
  106954.751     0.990625        11246       106.67
  107085.823     0.992188        11264       128.00
  107151.359     0.992969        11275       142.22
  107216.895     0.993750        11285       160.00
  107282.431     0.994531        11295       182.86
  107282.431     0.995313        11295       213.33
  107413.503     0.996094        11308       256.00
  107479.039     0.996484        11315       284.44
  107479.039     0.996875        11315       320.00
  107544.575     0.997266        11320       365.71
  107610.111     0.997656        11327       426.67
  107610.111     0.998047        11327       512.00
  107675.647     0.998242        11334       568.89
  107675.647     0.998437        11334       640.00
  107675.647     0.998633        11334       731.43
  107741.183     0.998828        11340       853.33
  107741.183     0.999023        11340      1024.00
  107741.183     0.999121        11340      1137.78
  107741.183     0.999219        11340      1280.00
  107806.719     0.999316        11344      1462.86
  107806.719     0.999414        11344      1706.67
  107806.719     0.999512        11344      2048.00
  107806.719     0.999561        11344      2275.56
  107806.719     0.999609        11344      2560.00
  107872.255     0.999658        11346      2925.71
  107872.255     0.999707        11346      3413.33
  107872.255     0.999756        11346      4096.00
  107872.255     0.999780        11346      4551.11
  107872.255     0.999805        11346      5120.00
  107937.791     0.999829        11347      5851.43
  107937.791     0.999854        11347      6826.67
  107937.791     0.999878        11347      8192.00
  107937.791     0.999890        11347      9102.22
  107937.791     0.999902        11347     10240.00
  108003.327     0.999915        11348     11702.86
  108003.327     1.000000        11348          inf
#[Mean    =    57954.766, StdDeviation   =    28593.373]
#[Max     =   107937.792, Total count    =        11348]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12244 requests in 2.00m, 3.35MB read
  Non-2xx or 3xx responses: 12244
Requests/sec:    102.01
Transfer/sec:     28.59KB

Run #4

Running 2m test @ https://api.thriveglobal.com/users/initialize
  23 threads and 23 connections
  Thread calibration: mean lat.: 3885.361ms, rate sampling interval: 13221ms
  Thread calibration: mean lat.: 3884.315ms, rate sampling interval: 13238ms
  Thread calibration: mean lat.: 3878.996ms, rate sampling interval: 13221ms
  Thread calibration: mean lat.: 3899.004ms, rate sampling interval: 13279ms
  Thread calibration: mean lat.: 3937.381ms, rate sampling interval: 13459ms
  Thread calibration: mean lat.: 3932.576ms, rate sampling interval: 13467ms
  Thread calibration: mean lat.: 3858.585ms, rate sampling interval: 13099ms
  Thread calibration: mean lat.: 3887.552ms, rate sampling interval: 13320ms
  Thread calibration: mean lat.: 3884.155ms, rate sampling interval: 13213ms
  Thread calibration: mean lat.: 3906.260ms, rate sampling interval: 13262ms
  Thread calibration: mean lat.: 3927.674ms, rate sampling interval: 13467ms
  Thread calibration: mean lat.: 3909.567ms, rate sampling interval: 13377ms
  Thread calibration: mean lat.: 3914.638ms, rate sampling interval: 13279ms
  Thread calibration: mean lat.: 3877.116ms, rate sampling interval: 13213ms
  Thread calibration: mean lat.: 3923.313ms, rate sampling interval: 13361ms
  Thread calibration: mean lat.: 3898.501ms, rate sampling interval: 13279ms
  Thread calibration: mean lat.: 3919.102ms, rate sampling interval: 13410ms
  Thread calibration: mean lat.: 3938.069ms, rate sampling interval: 13459ms
  Thread calibration: mean lat.: 3865.320ms, rate sampling interval: 13156ms
  Thread calibration: mean lat.: 3897.927ms, rate sampling interval: 13279ms
  Thread calibration: mean lat.: 3899.678ms, rate sampling interval: 13369ms
  Thread calibration: mean lat.: 3907.374ms, rate sampling interval: 13361ms
  Thread calibration: mean lat.: 3894.944ms, rate sampling interval: 13254ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.61s    23.18s    1.47m    57.85%
    Req/Sec    11.13      0.34    12.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   47.74s
 75.000%    1.13m
 90.000%    1.33m
 99.000%    1.45m
 99.900%    1.46m
 99.990%    1.47m
 99.999%    1.47m
100.000%    1.47m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7372.799     0.000000            1         1.00
   15499.263     0.100000         2996         1.11
   23560.191     0.200000         5987         1.25
   31490.047     0.300000         8980         1.43
   39583.743     0.400000        11976         1.67
   47742.975     0.500000        14980         2.00
   51740.671     0.550000        16464         2.22
   55738.367     0.600000        17960         2.50
   59801.599     0.650000        19461         2.86
   63700.991     0.700000        20960         3.33
   67633.151     0.750000        22455         4.00
   69664.767     0.775000        23203         4.44
   71696.383     0.800000        23962         5.00
   73859.071     0.825000        24721         5.71
   75825.151     0.850000        25453         6.67
   77791.231     0.875000        26206         8.00
   78774.271     0.887500        26577         8.89
   79757.311     0.900000        26951        10.00
   80740.351     0.912500        27319        11.43
   81723.391     0.925000        27698        13.33
   82706.431     0.937500        28085        16.00
   83165.183     0.943750        28263        17.78
   83623.935     0.950000        28445        20.00
   84148.223     0.956250        28647        22.86
   84606.975     0.962500        28828        26.67
   85065.727     0.968750        29005        32.00
   85327.871     0.971875        29107        35.56
   85524.479     0.975000        29186        40.00
   85786.623     0.978125        29288        45.71
   86048.767     0.981250        29390        53.33
   86245.375     0.984375        29467        64.00
   86376.447     0.985938        29521        71.11
   86507.519     0.987500        29573        80.00
   86638.591     0.989062        29624        91.43
   86769.663     0.990625        29677       106.67
   86835.199     0.992188        29700       128.00
   86900.735     0.992969        29725       142.22
   86966.271     0.993750        29752       160.00
   87031.807     0.994531        29778       182.86
   87097.343     0.995313        29801       213.33
   87162.879     0.996094        29818       256.00
   87228.415     0.996484        29835       284.44
   87293.951     0.996875        29848       320.00
   87359.487     0.997266        29860       365.71
   87425.023     0.997656        29871       426.67
   87490.559     0.998047        29880       512.00
   87556.095     0.998242        29891       568.89
   87556.095     0.998437        29891       640.00
   87621.631     0.998633        29900       731.43
   87621.631     0.998828        29900       853.33
   87687.167     0.999023        29910      1024.00
   87687.167     0.999121        29910      1137.78
   87687.167     0.999219        29910      1280.00
   87752.703     0.999316        29918      1462.86
   87752.703     0.999414        29918      1706.67
   87818.239     0.999512        29925      2048.00
   87818.239     0.999561        29925      2275.56
   87818.239     0.999609        29925      2560.00
   87818.239     0.999658        29925      2925.71
   87818.239     0.999707        29925      3413.33
   87883.775     0.999756        29929      4096.00
   87883.775     0.999780        29929      4551.11
   87883.775     0.999805        29929      5120.00
   87883.775     0.999829        29929      5851.43
   87883.775     0.999854        29929      6826.67
   87949.311     0.999878        29932      8192.00
   87949.311     0.999890        29932      9102.22
   87949.311     0.999902        29932     10240.00
   87949.311     0.999915        29932     11702.86
   87949.311     0.999927        29932     13653.33
   87949.311     0.999939        29932     16384.00
   87949.311     0.999945        29932     18204.44
   87949.311     0.999951        29932     20480.00
   87949.311     0.999957        29932     23405.71
   87949.311     0.999963        29932     27306.67
   88014.847     0.999969        29933     32768.00
   88014.847     1.000000        29933          inf
#[Mean    =    47614.432, StdDeviation   =    23175.603]
#[Max     =    87949.312, Total count    =        29933]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  32603 requests in 2.00m, 8.92MB read
  Non-2xx or 3xx responses: 32603
Requests/sec:    271.54
Transfer/sec:     76.10KB

Run #5

Running 2m test @ https://api.thriveglobal.com/users/initialize
  23 threads and 23 connections
  Thread calibration: mean lat.: 3847.991ms, rate sampling interval: 13221ms
  Thread calibration: mean lat.: 3896.198ms, rate sampling interval: 13418ms
  Thread calibration: mean lat.: 3845.585ms, rate sampling interval: 13328ms
  Thread calibration: mean lat.: 3902.634ms, rate sampling interval: 13402ms
  Thread calibration: mean lat.: 3902.874ms, rate sampling interval: 13459ms
  Thread calibration: mean lat.: 3953.988ms, rate sampling interval: 13500ms
  Thread calibration: mean lat.: 3874.148ms, rate sampling interval: 13221ms
  Thread calibration: mean lat.: 3938.691ms, rate sampling interval: 13484ms
  Thread calibration: mean lat.: 3895.537ms, rate sampling interval: 13410ms
  Thread calibration: mean lat.: 3874.009ms, rate sampling interval: 13238ms
  Thread calibration: mean lat.: 3868.963ms, rate sampling interval: 13238ms
  Thread calibration: mean lat.: 3873.261ms, rate sampling interval: 13221ms
  Thread calibration: mean lat.: 3890.657ms, rate sampling interval: 13418ms
  Thread calibration: mean lat.: 3899.062ms, rate sampling interval: 13410ms
  Thread calibration: mean lat.: 3921.313ms, rate sampling interval: 13451ms
  Thread calibration: mean lat.: 3896.180ms, rate sampling interval: 13410ms
  Thread calibration: mean lat.: 3936.361ms, rate sampling interval: 13467ms
  Thread calibration: mean lat.: 3891.171ms, rate sampling interval: 13361ms
  Thread calibration: mean lat.: 3848.176ms, rate sampling interval: 13213ms
  Thread calibration: mean lat.: 3894.014ms, rate sampling interval: 13410ms
  Thread calibration: mean lat.: 3821.876ms, rate sampling interval: 13172ms
  Thread calibration: mean lat.: 3865.655ms, rate sampling interval: 13213ms
  Thread calibration: mean lat.: 3915.413ms, rate sampling interval: 13451ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    48.47s    23.21s    1.47m    58.53%
    Req/Sec    11.15      0.61    12.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   48.92s
 75.000%    1.14m
 90.000%    1.34m
 99.000%    1.45m
 99.900%    1.47m
 99.990%    1.47m
 99.999%    1.47m
100.000%    1.47m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7376.895     0.000000            1         1.00
   15515.647     0.100000         2953         1.11
   24313.855     0.200000         5915         1.25
   33095.679     0.300000         8860         1.43
   41025.535     0.400000        11823         1.67
   48922.623     0.500000        14766         2.00
   52887.551     0.550000        16241         2.22
   56852.479     0.600000        17726         2.50
   60817.407     0.650000        19207         2.86
   64716.799     0.700000        20671         3.33
   68616.191     0.750000        22171         4.00
   70451.199     0.775000        22885         4.44
   72417.279     0.800000        23628         5.00
   74383.359     0.825000        24368         5.71
   76349.439     0.850000        25108         6.67
   78249.983     0.875000        25848         8.00
   79233.023     0.887500        26226         8.89
   80150.527     0.900000        26581        10.00
   81133.567     0.912500        26964        11.43
   82051.071     0.925000        27316        13.33
   83034.111     0.937500        27686        16.00
   83558.399     0.943750        27890        17.78
   84017.151     0.950000        28065        20.00
   84475.903     0.956250        28244        22.86
   85000.191     0.962500        28439        26.67
   85458.943     0.968750        28611        32.00
   85721.087     0.971875        28712        35.56
   85983.231     0.975000        28813        40.00
   86179.839     0.978125        28888        45.71
   86441.983     0.981250        28985        53.33
   86704.127     0.984375        29088        64.00
   86835.199     0.985938        29135        71.11
   86900.735     0.987500        29161        80.00
   87031.807     0.989062        29212        91.43
   87162.879     0.990625        29263       106.67
   87293.951     0.992188        29313       128.00
   87359.487     0.992969        29336       142.22
   87425.023     0.993750        29358       160.00
   87490.559     0.994531        29380       182.86
   87556.095     0.995313        29402       213.33
   87621.631     0.996094        29419       256.00
   87687.167     0.996484        29436       284.44
   87752.703     0.996875        29453       320.00
   87752.703     0.997266        29453       365.71
   87818.239     0.997656        29467       426.67
   87883.775     0.998047        29480       512.00
   87883.775     0.998242        29480       568.89
   87949.311     0.998437        29491       640.00
   87949.311     0.998633        29491       731.43
   88014.847     0.998828        29499       853.33
   88080.383     0.999023        29507      1024.00
   88080.383     0.999121        29507      1137.78
   88080.383     0.999219        29507      1280.00
   88145.919     0.999316        29513      1462.86
   88145.919     0.999414        29513      1706.67
   88211.455     0.999512        29519      2048.00
   88211.455     0.999561        29519      2275.56
   88211.455     0.999609        29519      2560.00
   88211.455     0.999658        29519      2925.71
   88276.991     0.999707        29522      3413.33
   88276.991     0.999756        29522      4096.00
   88342.527     0.999780        29526      4551.11
   88342.527     0.999805        29526      5120.00
   88342.527     0.999829        29526      5851.43
   88342.527     0.999854        29526      6826.67
   88342.527     0.999878        29526      8192.00
   88342.527     0.999890        29526      9102.22
   88408.063     0.999902        29528     10240.00
   88408.063     0.999915        29528     11702.86
   88408.063     0.999927        29528     13653.33
   88408.063     0.999939        29528     16384.00
   88408.063     0.999945        29528     18204.44
   88408.063     0.999951        29528     20480.00
   88408.063     0.999957        29528     23405.71
   88408.063     0.999963        29528     27306.67
   88473.599     0.999969        29529     32768.00
   88473.599     1.000000        29529          inf
#[Mean    =    48467.538, StdDeviation   =    23208.350]
#[Max     =    88408.064, Total count    =        29529]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  32170 requests in 2.00m, 8.81MB read
  Non-2xx or 3xx responses: 32170
Requests/sec:    267.91
Transfer/sec:     75.09KB

Run #6

Running 2m test @ https://api.thriveglobal.com/users/initialize
  23 threads and 23 connections
  Thread calibration: mean lat.: 4049.460ms, rate sampling interval: 13631ms
  Thread calibration: mean lat.: 4023.429ms, rate sampling interval: 13492ms
  Thread calibration: mean lat.: 4024.511ms, rate sampling interval: 13492ms
  Thread calibration: mean lat.: 4018.160ms, rate sampling interval: 13467ms
  Thread calibration: mean lat.: 4035.261ms, rate sampling interval: 13475ms
  Thread calibration: mean lat.: 4047.108ms, rate sampling interval: 13582ms
  Thread calibration: mean lat.: 4050.902ms, rate sampling interval: 13623ms
  Thread calibration: mean lat.: 4056.802ms, rate sampling interval: 13574ms
  Thread calibration: mean lat.: 3880.062ms, rate sampling interval: 13484ms
  Thread calibration: mean lat.: 4043.876ms, rate sampling interval: 13541ms
  Thread calibration: mean lat.: 3905.463ms, rate sampling interval: 13320ms
  Thread calibration: mean lat.: 3892.638ms, rate sampling interval: 13410ms
  Thread calibration: mean lat.: 3871.986ms, rate sampling interval: 13238ms
  Thread calibration: mean lat.: 4047.474ms, rate sampling interval: 13623ms
  Thread calibration: mean lat.: 4043.996ms, rate sampling interval: 13533ms
  Thread calibration: mean lat.: 4046.365ms, rate sampling interval: 13623ms
  Thread calibration: mean lat.: 4031.156ms, rate sampling interval: 13467ms
  Thread calibration: mean lat.: 3864.129ms, rate sampling interval: 13230ms
  Thread calibration: mean lat.: 3868.173ms, rate sampling interval: 13279ms
  Thread calibration: mean lat.: 4045.600ms, rate sampling interval: 13533ms
  Thread calibration: mean lat.: 4040.187ms, rate sampling interval: 13541ms
  Thread calibration: mean lat.: 4028.083ms, rate sampling interval: 13492ms
  Thread calibration: mean lat.: 4042.370ms, rate sampling interval: 13541ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.29s    23.03s    1.47m    57.75%
    Req/Sec    11.30      0.46    12.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   47.25s
 75.000%    1.12m
 90.000%    1.32m
 99.000%    1.44m
 99.900%    1.46m
 99.990%    1.47m
 99.999%    1.47m
100.000%    1.47m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7360.511     0.000000            1         1.00
   15417.343     0.100000         3009         1.11
   23379.967     0.200000         6021         1.25
   31342.591     0.300000         9031         1.43
   39354.367     0.400000        12042         1.67
   47251.455     0.500000        15054         2.00
   51249.151     0.550000        16560         2.22
   55181.311     0.600000        18057         2.50
   59146.239     0.650000        19560         2.86
   63111.167     0.700000        21064         3.33
   67305.471     0.750000        22573         4.00
   69337.087     0.775000        23340         4.44
   71303.167     0.800000        24086         5.00
   73269.247     0.825000        24828         5.71
   75235.327     0.850000        25578         6.67
   77266.943     0.875000        26340         8.00
   78249.983     0.887500        26706         8.89
   79298.559     0.900000        27091        10.00
   80347.135     0.912500        27482        11.43
   81330.175     0.925000        27848        13.33
   82313.215     0.937500        28212        16.00
   82837.503     0.943750        28408        17.78
   83361.791     0.950000        28611        20.00
   83820.543     0.956250        28785        22.86
   84344.831     0.962500        28983        26.67
   84803.583     0.968750        29155        32.00
   85065.727     0.971875        29261        35.56
   85327.871     0.975000        29358        40.00
   85524.479     0.978125        29433        45.71
   85786.623     0.981250        29534        53.33
   86048.767     0.984375        29631        64.00
   86179.839     0.985938        29682        71.11
   86310.911     0.987500        29735        80.00
   86441.983     0.989062        29783        91.43
   86573.055     0.990625        29830       106.67
   86704.127     0.992188        29874       128.00
   86769.663     0.992969        29894       142.22
   86835.199     0.993750        29913       160.00
   86900.735     0.994531        29930       182.86
   86966.271     0.995313        29949       213.33
   87097.343     0.996094        29986       256.00
   87097.343     0.996484        29986       284.44
   87162.879     0.996875        30002       320.00
   87228.415     0.997266        30018       365.71
   87293.951     0.997656        30030       426.67
   87359.487     0.998047        30043       512.00
   87359.487     0.998242        30043       568.89
   87359.487     0.998437        30043       640.00
   87425.023     0.998633        30053       731.43
   87490.559     0.998828        30062       853.33
   87490.559     0.999023        30062      1024.00
   87556.095     0.999121        30067      1137.78
   87556.095     0.999219        30067      1280.00
   87621.631     0.999316        30071      1462.86
   87687.167     0.999414        30076      1706.67
   87687.167     0.999512        30076      2048.00
   87752.703     0.999561        30080      2275.56
   87752.703     0.999609        30080      2560.00
   87752.703     0.999658        30080      2925.71
   87818.239     0.999707        30083      3413.33
   87818.239     0.999756        30083      4096.00
   87883.775     0.999780        30086      4551.11
   87883.775     0.999805        30086      5120.00
   87883.775     0.999829        30086      5851.43
   87883.775     0.999854        30086      6826.67
   87949.311     0.999878        30088      8192.00
   87949.311     0.999890        30088      9102.22
   87949.311     0.999902        30088     10240.00
   87949.311     0.999915        30088     11702.86
   87949.311     0.999927        30088     13653.33
   88014.847     0.999939        30089     16384.00
   88014.847     0.999945        30089     18204.44
   88014.847     0.999951        30089     20480.00
   88014.847     0.999957        30089     23405.71
   88014.847     0.999963        30089     27306.67
   88080.383     0.999969        30090     32768.00
   88080.383     1.000000        30090          inf
#[Mean    =    47292.112, StdDeviation   =    23032.252]
#[Max     =    88014.848, Total count    =        30090]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  32721 requests in 2.00m, 8.96MB read
  Non-2xx or 3xx responses: 32721
Requests/sec:    272.44
Transfer/sec:     76.36KB